{
  "categories": [
    {
      "id": "integration",
      "label": "Integration",
      "projects": [
        {
          "title": "Enterprise Integration Platform",
          "client": "Dr Schnell",
          "date": "2024",
          "description": "Developed a comprehensive integration platform using Mulesoft to connect various enterprise systems.",
          "image": "/projects/mule-integration/mule_API_Integration.png",
          "link": "/projects/integration-platform",
          "technologies": ["Mulesoft", "Anypoint Platform", "RAML API"],
          "images": [
            {
              "imageUrl": "/projects/mule-integration/mule_API_Integration.png",
              "description": "Integration architecture diagram"
            }
          ],
          "longDescription": [
            "Created a centralized integration platform to connect various enterprise systems such as Salesforce, Microsoft Business Central and a PHP webshop among others.",
            "Implemented API-led connectivity approach with reusable assets such as parent poms and API RAML fragments"
          ]
        },
        {
          "title": "Java Train Electricity Usage and Contract Analysis",
          "client": "Deutsche Bahn Netz",
          "date": "2024",
          "description": "Developed a Java-based system to analyze train electricity consumption and contract compliance.",
          "image": "/projects/java-train-db-netz/java_train_data.png",
          "link": "/projects/train-electricity-analysis",
          "technologies": [
            "Java",
            "JBoss",
            "SOAPUI",
            "TIBCO EMS",
            "Bash Scripting",
            "JPQL",
            "Oracle"
          ],
          "images": [
            {
              "imageUrl": "/projects/java-train-db-netz/java_train_data.png",
              "description": "Data visualization of train electricity consumption and contract compliance."
            }
          ],
          "longDescription": [
            "The system automates the extraction, enrichment, and validation of train electricity usage data.",
            "A configurable service retrieves data based on user-defined timeframes, ensuring flexibility and accuracy.",
            "Integration with JBoss and TIBCO EMS allows seamless data processing and dispatch to downstream systems.",
            "The solution has significantly improved the accuracy of contract compliance monitoring and billing adjustments."
          ]
        },
        {
          "title": "AWS Cloud Customer Document Unlocking Service",
          "client": "Ignite Solutions",
          "date": "2023",
          "description": "Developed an automated document unlocking and decryption service using AWS Lambda and SSM.",
          "image": "/projects/document-unlocking/document_unlocking_service.png",
          "link": "/projects/aws-document-unlocking",
          "technologies": [
            "Lambda",
            "S3",
            "CodePipeline",
            "API Gateway",
            "SSM",
            "VPC",
            "SAM"
          ],
          "images": [
            {
              "imageUrl": "/projects/document-unlocking/document_unlocking_service.png",
              "description": "Automated document unlocking and decryption service interface."
            }
          ],
          "longDescription": [
            "The API service automates the decryption of banking partner documents using AWS Lambda and SSM.",
            "By eliminating manual key retrieval, the solution accelerates document processing for OCR analysis.",
            "Operating within a private VPC ensures security and compliance with financial regulations.",
            "The serverless architecture reduced infrastructure costs by up to 99%, optimizing performance and scalability."
          ]
        },
        {
          "title": "Tibco BW Train Electricity Invoicing Integration Platform",
          "client": "Deutsche Bahn Energie",
          "date": "2021",
          "description": "Developed an integration platform to automate train electricity invoicing and reconciliation.",
          "image": "/projects/db-energie-train/db_energy_train.png",
          "link": "/projects/train-electricity-invoicing",
          "technologies": [
            "TIBCO BW",
            "TIBCO BPM",
            "TIBCO EMS",
            "TIBCO Spotfire",
            "Oracle DB",
            "Samba Share",
            "TIBCO Business Connect"
          ],
          "images": [
            {
              "imageUrl": "/projects/db-energie-train/db_energy_train.png",
              "description": "Invoice correction dashboard comparing predicted vs. actual energy use."
            }
          ],
          "longDescription": [
            "The invoicing platform automatically reconciles predicted and actual train energy consumption.",
            "Self-correcting error handling ensures invoices reflect accurate data before they are sent.",
            "Human intervention workflows allow manual review and corrections when anomalies are detected.",
            "The platform increased invoicing accuracy by threefold, reducing financial penalties and operational inefficiencies."
          ]
        },
        {
          "title": "System Health Check Platform",
          "client": "Deutsche Bahn Energie",
          "date": "2020",
          "description": "Developed a system health check platform to monitor the uptime and availability of critical systems.",
          "image": "/projects/system-health-check/system-health-check.png",
          "link": "/projects/system-health-check",
          "technologies": [
            "Bash Scripting",
            "TIBCO BW",
            "SAP",
            "TIBCO BPM",
            "EVIJET",
            "BELVIS"
          ],
          "images": [
            {
              "imageUrl": "/projects/system-health-check/system-health-check.png",
              "description": "System health dashboard showing integration system uptime."
            }
          ],
          "longDescription": [
            "This system automates health monitoring across all integration platforms, replacing manual verification.",
            "Health check endpoints allow API-based verification of database and third-party system availability.",
            "Aggregated health reports are sent via email and Microsoft Teams for real-time issue tracking.",
            "The solution significantly reduced system downtime by enabling proactive issue resolution."
          ]
        }
      ]
    },
    {
      "id": "devops",
      "label": "DevOps",
      "projects": [
        {
          "title": "Github Actions CI/CD Mulesoft Pipeline",
          "date": "2024",
          "description": "Implemented a CI/CD pipeline for Mulesoft applications using GitHub Actions, ensuring consistent deployments and governance.",
          "image": "/projects/mule-cicd/standard_packaging.png",
          "link": "/projects/github-actions-mulesoft",
          "technologies": [
            "Mulesoft",
            "Microsoft ERP",
            "Salesforce CRM",
            "Pimcore PHP",
            "GitHub CICD"
          ],
          "images": [
            {
              "imageUrl": "/projects/mule-cicd/standard_packaging.png",
              "description": "CI/CD pipeline execution for Mulesoft deployment."
            }
          ],
          "longDescription": [
            "This CI/CD pipeline automates the deployment of Mulesoft applications, ensuring consistency across environments.",
            "GitHub Actions enforces separation of duties, allowing only authorized users to release code.",
            "A parent POM was introduced to unify dependency management and streamline the build process.",
            "The pipeline has led to faster deployments, fewer dependency conflicts, and increased governance over releases."
          ]
        },
        {
          "title": "GitLab Runner CI/CD JAVA Pipeline",
          "client": "Deutsche Bahn Netz",
          "date": "2023",
          "description": "Implemented a GitLab Runner pipeline for Java applications, automating build, test, and deployment processes.",
          "image": "/projects/gitlab-runner-java/java_gitlab_runner.png",
          "link": "/projects/gitlab-java-pipeline",
          "technologies": [
            "Java",
            "Maven",
            "JBoss",
            "GitLab Runner",
            "Docker",
            "Bash Scripting",
            "Debian",
            "EC2"
          ],
          "images": [
            {
              "imageUrl": "/projects/gitlab-runner-java/java_gitlab_runner.png",
              "description": "GitLab Runner pipeline handling Java build, test, and deployment."
            }
          ],
          "longDescription": [
            "The GitLab Runner pipeline was introduced to replace Jenkins, reducing operational costs and improving efficiency.",
            "AWS EC2 instances were optimized to be burstable, reducing unnecessary costs during idle periods.",
            "The pipeline automates the full Java build process, including testing, packaging, and deployment to a JBoss server.",
            "Versioning and artifact uploads are now automated, ensuring consistency across deployments."
          ]
        },
        {
          "title": "GitLab Runner CI/CD Scheduled Nightly Integration Tests",
          "client": "Deutsche Bahn Netz",
          "date": "2023",
          "description": "Implemented scheduled nightly integration tests using GitLab Runner, Docker, and SOAPUI.",
          "image": "/projects/gitlab-runner-test/gitlab-runner-testing.png",
          "link": "/projects/gitlab-nightly-tests",
          "technologies": [
            "SOAPUI",
            "GitLab Runner",
            "Docker",
            "Bash Scripting",
            "EC2"
          ],
          "images": [
            {
              "imageUrl": "/projects/gitlab-runner-test/gitlab-runner-testing.png",
              "description": "Automated nightly tests executed in a Dockerized GitLab CI/CD pipeline."
            }
          ],
          "longDescription": [
            "Previously, integration tests were manually triggered by testers, leading to inconsistencies and production errors.",
            "The new GitLab CI/CD pipeline automatically runs SOAPUI regression tests every night within a Docker container.",
            "Failures are logged and emailed to the team, ensuring that issues are identified before they impact production.",
            "This automation significantly improved test coverage and reliability, reducing deployment risks."
          ]
        }
      ]
    },
    {
      "id": "webApps",
      "label": "Web Apps",
      "projects": [
        {
          "title": "Angular Release Management Platform",
          "client": "Ignite Solutions",
          "date": "2023",
          "description": "Developed a release management platform using Angular and AWS services to manage microservices deployment.",
          "image": "/projects/release-management/release_management.png",
          "link": "/projects/release-management",
          "technologies": [
            "Angular",
            "Lambda",
            "S3",
            "Amplify",
            "CodePipeline",
            "API Gateway",
            "VPC",
            "Cognito",
            "DynamoDB",
            "AppSync",
            "Step Functions",
            "SAM",
            "TypeScript"
          ],
          "images": [
            {
              "imageUrl": "/projects/release-management/release_management.png",
              "description": "Dashboard for managing microservices release versions and properties."
            }
          ],
          "longDescription": [
            "This platform allows both technical and business users to oversee the release process of over 150 microservices.",
            "It includes a robust dashboard for tracking deployments, versioning, and managing configuration properties.",
            "By integrating with AWS services and implementing automation, it significantly reduced errors related to misconfigured deployments.",
            "The adoption of this platform improved governance, operational efficiency, and reduced production issues."
          ]
        },
        {
          "title": "AngularJS Train Electricity Consumption Billing Platform",
          "client": "Deutsche Bahn Energie",
          "date": "2022",
          "description": "Developed a billing platform using AngularJS to manage train electricity consumption and billing.",
          "image": "/projects/db-electricity-consumption/electricity_consumption_platform.png",
          "link": "/projects/electricity-billing",
          "technologies": [
            "TIBCO BPM",
            "AngularJS",
            "Oracle DB"
          ],
          "images": [
            {
              "imageUrl": "/projects/db-electricity-consumption/electricity_consumption_platform.png",
              "description": "Dashboard showing real-time electricity consumption and billing status."
            }
          ],
          "longDescription": [
            "This billing platform was designed to improve visibility into train energy consumption and contract management.",
            "It includes automated tools to detect anomalies in electricity usage and flag potential billing inconsistencies.",
            "Users can compare predicted vs. actual consumption through interactive dashboards.",
            "The system improved billing accuracy, reduced financial losses, and streamlined reporting for better decision-making."
          ]
        },
        {
          "title": "Tibco BPM Private Investment Banking Automation",
          "client": "Rand Merchant Bank",
          "date": "2017 - 2019",
          "description": "Developed a private banking automation system using TIBCO BPM to streamline investment processes.",
          "image": "/projects/private-banking-bpm/private_banking_bpm.png",
          "link": "/projects/banking-automation",
          "technologies": [
            "TIBCO BPM",
            "TIBCO Spotfire",
            "TIBCO BW",
            "TIBCO EMS",
            "GWT Forms",
            "MS SQL DB",
            "PostgreSQL",
            "MS SharePoint",
            "MS PowerBI"
          ],
          "images": [
            {
              "imageUrl": "/projects/private-banking-bpm/private_banking_bpm.png",
              "description": "User interface for workflow approvals and investment banking automation."
            }
          ],
          "longDescription": [
            "This system automated critical investment banking processes, improving efficiency and compliance.",
            "The solution integrated with multiple banking platforms to support workflow automation and data consistency.",
            "It included 4-eye review processes, approval workflows, SLA tracking, and user access control for regulatory compliance.",
            "Through advanced reporting and analytics, the system provided key insights for financial decision-making.",
            "The project ensured seamless integration with existing IT infrastructure, reducing operational risks and improving data transparency."
          ]
        }
      ]
    },
    {
      "id": "websites",
      "label": "Websites",
      "projects": [
        {
          "title": "Nursery School Website",
          "client": "Little Sparrows",
          "date": "2024",
          "description": "Designed and deployed a nursery school website using AWS services for fast content delivery and seamless updates.",
          "image": "/projects/little-sparrows/little_sparrow_logo.png",
          "link": "https://littlesparrows.co.za/",
          "technologies": [
            "Route53",
            "Cloudfront",
            "S3",
            "CodeBuild",
            "GitHub"
          ],
          "images": [
          ],
          "longDescription": [
            "The website was built to provide parents with up-to-date information about the nursery school, including class details and events.",
            "It features a fully responsive design, ensuring seamless navigation on both desktop and mobile devices.",
            "Deployed using AWS services, the site leverages CloudFront for fast content delivery and S3 for static file storage.",
            "CI/CD automation via CodeBuild and GitHub ensures seamless updates without downtime."
          ]
        },
        {
          "title": "Artist Portfolio Website",
          "client": "Hazel Buchan",
          "date": "2024",
          "description": "Designed and deployed an artist portfolio website to showcase handmade paper flowers and engage potential customers.",
          "image": "/projects/hazel-buchan/HB_logo.png",
          "link": "https://hazelbuchan.co.za/",
          "technologies": [
            "Route53",
            "Cloudfront",
            "S3",
            "CodeBuild",
            "GitHub"
          ],
          "images": [
          ],
          "longDescription": [
            "The portfolio website was designed to showcase the artist’s work in an engaging and interactive way.",
            "It includes a contact form and an enquiry system for customers interested in purchasing handmade paper flowers.",
            "Fully optimized for responsiveness, ensuring a great user experience on mobile and desktop.",
            "CI/CD capabilities enable automatic deployments via AWS services, reducing maintenance efforts."
          ]
        },
        {
          "title": "Consulting Company Website",
          "client": "Ignite Solutions",
          "date": "2021",
          "description": "Designed and deployed a consulting company website to showcase services and establish an online presence.",
          "image": "/projects/ignite-solutions/is_logo.png",
          "link": "https://ignitesolutions.eu/",
          "technologies": [
            "Route53",
            "Cloudfront",
            "S3",
            "CodeBuild",
            "GitHub"
          ],
          "images": [
          ],
          "longDescription": [
            "The consulting firm’s website was created to provide an online presence and showcase their services.",
            "It features an elegant and professional design, aligned with the company’s branding and hexagon-themed logo.",
            "The website is fully responsive and optimized for different devices, ensuring a smooth user experience.",
            "CI/CD capabilities enable easy updates through GitHub and AWS CodeBuild, allowing the site to be maintained with minimal effort."
          ]
        }
      ]
    }
  ]
}
