{
  "categories": [
    {
      "id": "integration",
      "label": "Integration",
      "projects": [
        {
          "title": "Enterprise Integration Platform",
          "client": "Dr Schnell",
          "date": "2024",
          "description": "Developed a comprehensive integration platform using Mulesoft to connect various enterprise systems.",
          "image": "https://images.unsplash.com/photo-1451187580459-43490279c0fa?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60",
          "link": "/projects/integration-platform",
          "technologies": ["Mulesoft", "API Gateway", "OAuth2", "PostgreSQL", "Elasticsearch"],
          "images": [
            {
              "imageUrl": "https://images.unsplash.com/photo-1451187580459-43490279c0fa?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Integration architecture diagram"
            },
            {
              "imageUrl": "https://images.unsplash.com/photo-1558494949-ef010cbdcc31?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "API management dashboard"
            }
          ],
          "longDescription": [
            "Created a centralized integration platform to connect various enterprise systems and streamline data flow.",
            "Implemented API-led connectivity approach with reusable assets and clear governance model.",
            "Built comprehensive monitoring and alerting system for all integration flows."
          ]
        },
        {
          "title": "Java Train Electricity Usage and Contract Analysis",
          "client": "Deutsche Bahn Netz",
          "date": "2024",
          "description": "A downstream system required daily exports of train usage data for analysis and enrichment, ensuring alignment with train contracts and energy consumption thresholds. A configurable service was developed to retrieve, verify, enrich, and export data based on user-defined timeframes, improving data accuracy and accessibility for further processing.",
          "image": "https://images.unsplash.com/photo-1521791093227-9e24c896007a?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60",
          "link": "/projects/train-electricity-analysis",
          "technologies": [
            "Java",
            "JBoss",
            "SOAPUI",
            "TIBCO EMS",
            "Bash Scripting",
            "JPQL",
            "Oracle"
          ],
          "images": [
            {
              "imageUrl": "https://images.unsplash.com/photo-1524995997946-a1c2e315a42f?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Data visualization of train electricity consumption and contract compliance."
            },
            {
              "imageUrl": "https://images.unsplash.com/photo-1549923746-c502d488b3ea?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Automated data export for contract and energy threshold alignment."
            }
          ],
          "longDescription": [
            "The system automates the extraction, enrichment, and validation of train electricity usage data.",
            "A configurable service retrieves data based on user-defined timeframes, ensuring flexibility and accuracy.",
            "Integration with JBoss and TIBCO EMS allows seamless data processing and dispatch to downstream systems.",
            "The solution has significantly improved the accuracy of contract compliance monitoring and billing adjustments."
          ]
        },
        {
          "title": "AWS Cloud Customer Document Unlocking Service",
          "client": "Ignite Solutions",
          "date": "2023",
          "description": "A document unlocking API service was implemented to automate password retrieval and decryption of banking partner documents, eliminating the manual process of locating keys before OCR analysis. The solution operated within a private VPC, required no server management, and significantly reduced infrastructure costs by up to 99%, streamlining document processing for downstream systems.",
          "image": "https://images.unsplash.com/photo-1595071775043-8920e34499a5?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60",
          "link": "/projects/aws-document-unlocking",
          "technologies": [
            "Lambda",
            "S3",
            "CodePipeline",
            "API Gateway",
            "SSM",
            "VPC",
            "SAM"
          ],
          "images": [
            {
              "imageUrl": "https://images.unsplash.com/photo-1599491106182-18bd1691f486?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Automated document unlocking and decryption service interface."
            },
            {
              "imageUrl": "https://images.unsplash.com/photo-1610484826967-0e30eabacc7c?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "AWS Lambda function executing document decryption."
            }
          ],
          "longDescription": [
            "The API service automates the decryption of banking partner documents using AWS Lambda and SSM.",
            "By eliminating manual key retrieval, the solution accelerates document processing for OCR analysis.",
            "Operating within a private VPC ensures security and compliance with financial regulations.",
            "The serverless architecture reduced infrastructure costs by up to 99%, optimizing performance and scalability."
          ]
        },
        {
          "title": "Tibco BW Train Electricity Invoicing Integration Platform",
          "client": "Deutsche Bahn Energie",
          "date": "2021",
          "description": "A new integration platform was developed to ensure accurate and consistent invoicing, reducing fines and operational costs for the energy supplier. The platform featured self-correcting error handling and human intervention workflows to flag discrepancies between predicted and actual energy consumption, enabling invoice corrections before sending. As a result, invoicing accuracy tripled, improving financial and operational efficiency.",
          "image": "https://images.unsplash.com/photo-1571687949922-2b7059d2ce3d?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60",
          "link": "/projects/train-electricity-invoicing",
          "technologies": [
            "TIBCO BW",
            "TIBCO BPM",
            "TIBCO EMS",
            "TIBCO Spotfire",
            "Oracle DB",
            "Samba Share",
            "TIBCO Business Connect"
          ],
          "images": [
            {
              "imageUrl": "https://images.unsplash.com/photo-1599508708996-03a12f5ef2e9?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Invoice correction dashboard comparing predicted vs. actual energy use."
            },
            {
              "imageUrl": "https://images.unsplash.com/photo-1624293874030-fd00cb7a7d4d?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Automated energy invoicing system workflow."
            }
          ],
          "longDescription": [
            "The invoicing platform automatically reconciles predicted and actual train energy consumption.",
            "Self-correcting error handling ensures invoices reflect accurate data before they are sent.",
            "Human intervention workflows allow manual review and corrections when anomalies are detected.",
            "The platform increased invoicing accuracy by threefold, reducing financial penalties and operational inefficiencies."
          ]
        },
        {
          "title": "System Health Check Platform",
          "client": "Deutsche Bahn Energie",
          "date": "2020",
          "description": "A centralized health check system was implemented to automate daily system monitoring, replacing manual checks and saving operational time. Health check endpoints were added to all integration systems, allowing an API to verify database and third-party system availability. The aggregated system health was reported via Email and Microsoft Teams, enabling the team to proactively address issues and ensure system uptime.",
          "image": "https://images.unsplash.com/photo-1528458909337-9e1db5110c37?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60",
          "link": "/projects/system-health-check",
          "technologies": [
            "Bash Scripting",
            "TIBCO BW",
            "SAP",
            "TIBCO BPM",
            "EVIJET",
            "BELVIS"
          ],
          "images": [
            {
              "imageUrl": "https://images.unsplash.com/photo-1603126859726-c5e3d0b0dbf6?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "System health dashboard showing integration system uptime."
            },
            {
              "imageUrl": "https://images.unsplash.com/photo-1557259651-f27b943e5224?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Automated email notifications for system health checks."
            }
          ],
          "longDescription": [
            "This system automates health monitoring across all integration platforms, replacing manual verification.",
            "Health check endpoints allow API-based verification of database and third-party system availability.",
            "Aggregated health reports are sent via email and Microsoft Teams for real-time issue tracking.",
            "The solution significantly reduced system downtime by enabling proactive issue resolution."
          ]
        }
      ]
    },
    {
      "id": "devops",
      "label": "DevOps",
      "projects": [
        {
          "title": "Github Actions CI/CD Mulesoft Pipeline",
          "date": "2024",
          "description": "A CI/CD pipeline using GitHub Actions standardized packaging and deployment of Mulesoft applications, enforced separation of duties for controlled releases, and introduced a parent POM for consistent dependency management.",
          "image": "https://images.unsplash.com/photo-1556767576-35d2893c9a9f?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60",
          "link": "/projects/github-actions-mulesoft",
          "technologies": [
            "Mulesoft",
            "Microsoft ERP",
            "Salesforce CRM",
            "Pimcore PHP",
            "GitHub CICD"
          ],
          "images": [
            {
              "imageUrl": "https://images.unsplash.com/photo-1556766764-51efcb412b9b?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "CI/CD pipeline execution for Mulesoft deployment."
            },
            {
              "imageUrl": "https://images.unsplash.com/photo-1556761175-4b46a572b786?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Automated dependency management using Parent POM."
            }
          ],
          "longDescription": [
            "This CI/CD pipeline automates the deployment of Mulesoft applications, ensuring consistency across environments.",
            "GitHub Actions enforces separation of duties, allowing only authorized users to release code.",
            "A parent POM was introduced to unify dependency management and streamline the build process.",
            "The pipeline has led to faster deployments, fewer dependency conflicts, and increased governance over releases."
          ]
        },
        {
          "title": "GitLab Runner CI/CD JAVA Pipeline",
          "client": "Deutsche Bahn Netz",
          "date": "2023",
          "description": "An outdated and costly Jenkins setup was replaced with a GitLab Runner-based CI/CD pipeline running on a Dockerized EC2 instance, automating Java builds, tests, packaging, and deployments to a JBoss server.",
          "image": "https://images.unsplash.com/photo-1563986768609-322da13575f3?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60",
          "link": "/projects/gitlab-java-pipeline",
          "technologies": [
            "Java",
            "Maven",
            "JBoss",
            "GitLab Runner",
            "Docker",
            "Bash Scripting",
            "EC2"
          ],
          "images": [
            {
              "imageUrl": "https://images.unsplash.com/photo-1517245386807-bb43f82c33c4?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "GitLab Runner pipeline handling Java build, test, and deployment."
            },
            {
              "imageUrl": "https://images.unsplash.com/photo-1593113598332-4debcfdee562?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Automated artifact upload process replacing Jenkins' manual workflows."
            }
          ],
          "longDescription": [
            "The GitLab Runner pipeline was introduced to replace Jenkins, reducing operational costs and improving efficiency.",
            "AWS EC2 instances were optimized to be burstable, reducing unnecessary costs during idle periods.",
            "The pipeline automates the full Java build process, including testing, packaging, and deployment to a JBoss server.",
            "Versioning and artifact uploads are now automated, ensuring consistency across deployments."
          ]
        },
        {
          "title": "GitLab Runner CI/CD Scheduled Nightly Integration Tests",
          "client": "Deutsche Bahn Netz",
          "date": "2023",
          "description": "A GitLab CI/CD pipeline was introduced to automate regression testing for integration and test environments, replacing manual tester-triggered tests that led to errors in production.",
          "image": "https://images.unsplash.com/photo-1565373963433-53bcea4876e2?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60",
          "link": "/projects/gitlab-nightly-tests",
          "technologies": [
            "SOAPUI",
            "GitLab Runner",
            "Docker",
            "Bash Scripting",
            "EC2"
          ],
          "images": [
            {
              "imageUrl": "https://images.unsplash.com/photo-1586880244395-c9deb2442440?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Automated nightly tests executed in a Dockerized GitLab CI/CD pipeline."
            },
            {
              "imageUrl": "https://images.unsplash.com/photo-1573164713988-8665fc963095?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Email notifications for test failures sent to the development team."
            }
          ],
          "longDescription": [
            "Previously, integration tests were manually triggered by testers, leading to inconsistencies and production errors.",
            "The new GitLab CI/CD pipeline automatically runs SOAPUI regression tests every night within a Docker container.",
            "Failures are logged and emailed to the team, ensuring that issues are identified before they impact production.",
            "This automation significantly improved test coverage and reliability, reducing deployment risks."
          ]
        }
      ]
    },
    {
      "id": "webApps",
      "label": "Web Apps",
      "projects": [
        {
          "title": "Angular Release Management Platform",
          "client": "Ignite Solutions",
          "date": "2023",
          "description": "An integration platform in a private investment bank gained better control over packaging, deployment, and property management for over 150 microservices, reducing production issues caused by incorrect versions, passwords, and manual errors. A new interface and backend enabled technical and business users to track deployed components, manage properties, store artifacts, and oversee release management, improving operational efficiency and governance.",
          "image": "https://images.unsplash.com/photo-1521790797524-b2497295b8e9?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60",
          "link": "/projects/release-management",
          "technologies": [
            "Angular",
            "Lambda",
            "S3",
            "Amplify",
            "CodePipeline",
            "API Gateway",
            "VPC",
            "Cognito",
            "DynamoDB",
            "AppSync",
            "Step Functions",
            "SAM",
            "TypeScript"
          ],
          "images": [
            {
              "imageUrl": "https://images.unsplash.com/photo-1517245386807-bb43f82c33c4?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Dashboard for managing microservices release versions and properties."
            },
            {
              "imageUrl": "https://images.unsplash.com/photo-1565373963433-53bcea4876e2?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "UI for tracking deployed components and managing configurations."
            }
          ],
          "longDescription": [
            "This platform allows both technical and business users to oversee the release process of over 150 microservices.",
            "It includes a robust dashboard for tracking deployments, versioning, and managing configuration properties.",
            "By integrating with AWS services and implementing automation, it significantly reduced errors related to misconfigured deployments.",
            "The adoption of this platform improved governance, operational efficiency, and reduced production issues."
          ]
        },
        {
          "title": "AngularJS Train Electricity Consumption Billing Platform",
          "client": "Deutsche Bahn Energie",
          "date": "2022",
          "description": "The business department lacked visibility into electricity consumption, contracts, and billing for train owners, leading to costly billing inconsistencies. A user interface was developed to flag suspect consumption data, track billing status, and provide dashboards for predicted vs. actual energy use, enabling accurate, timely invoicing and better reporting for management.",
          "image": "https://images.unsplash.com/photo-1488646953014-85cb44e25828?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60",
          "link": "/projects/electricity-billing",
          "technologies": [
            "TIBCO BPM",
            "AngularJS",
            "Oracle DB"
          ],
          "images": [
            {
              "imageUrl": "https://images.unsplash.com/photo-1488646953014-85cb44e25828?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Dashboard showing real-time electricity consumption and billing status."
            },
            {
              "imageUrl": "https://images.unsplash.com/photo-1460925895917-afdab827c52f?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Data analysis view displaying historical consumption patterns."
            }
          ],
          "longDescription": [
            "This billing platform was designed to improve visibility into train energy consumption and contract management.",
            "It includes automated tools to detect anomalies in electricity usage and flag potential billing inconsistencies.",
            "Users can compare predicted vs. actual consumption through interactive dashboards.",
            "The system improved billing accuracy, reduced financial losses, and streamlined reporting for better decision-making."
          ]
        },
        {
          "title": "Tibco BPM Private Investment Banking Automation",
          "client": "Rand Merchant Bank",
          "date": "2017 - 2019",
          "description": "Improved banking system interoperability and performance by designing and implementing end-to-end solutions across multiple investment banking departments, requiring deep integration and domain knowledge. Delivered custom applications incorporating 4-eye review, approval workflows, SLAs, and user segregation, adapting each project to its specific business and technical requirements, while ensuring seamless integration with existing IT infrastructure.",
          "image": "https://images.unsplash.com/photo-1580910365203-41d02c6b3af7?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60",
          "link": "/projects/banking-automation",
          "technologies": [
            "TIBCO BPM",
            "TIBCO Spotfire",
            "TIBCO BW",
            "TIBCO EMS",
            "GWT Forms",
            "MS SQL DB",
            "PostgreSQL",
            "MS SharePoint",
            "MS PowerBI"
          ],
          "images": [
            {
              "imageUrl": "https://images.unsplash.com/photo-1504384308090-c894fdcc538d?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "User interface for workflow approvals and investment banking automation."
            },
            {
              "imageUrl": "https://images.unsplash.com/photo-1521790797524-b2497295b8e9?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Custom dashboard integrating financial data from multiple sources."
            }
          ],
          "longDescription": [
            "This system automated critical investment banking processes, improving efficiency and compliance.",
            "The solution integrated with multiple banking platforms to support workflow automation and data consistency.",
            "It included 4-eye review processes, approval workflows, SLA tracking, and user access control for regulatory compliance.",
            "Through advanced reporting and analytics, the system provided key insights for financial decision-making.",
            "The project ensured seamless integration with existing IT infrastructure, reducing operational risks and improving data transparency."
          ]
        }
      ]
    },
    {
      "id": "websites",
      "label": "Websites",
      "projects": [
        {
          "title": "Nursery School Website",
          "client": "Little Sparrows",
          "date": "2024",
          "description": "A new nursery school website was built and deployed, featuring a gallery, contact page, class details, and events. The site is live, fully responsive, and includes CI/CD capabilities, ensuring seamless updates and maintenance.",
          "image": "https://images.unsplash.com/photo-1556761175-4b46a572b786?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60",
          "link": "/projects/nursery-school-website",
          "technologies": [
            "Route53",
            "Cloudfront",
            "S3",
            "CodeBuild",
            "GitHub"
          ],
          "images": [
            {
              "imageUrl": "https://images.unsplash.com/photo-1599427302935-638237b64a6d?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Homepage of the nursery school website with a welcoming design."
            },
            {
              "imageUrl": "https://images.unsplash.com/photo-1603205867403-ec6c8c88f301?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Gallery section displaying nursery activities and class environments."
            }
          ],
          "longDescription": [
            "The website was built to provide parents with up-to-date information about the nursery school, including class details and events.",
            "It features a fully responsive design, ensuring seamless navigation on both desktop and mobile devices.",
            "Deployed using AWS services, the site leverages CloudFront for fast content delivery and S3 for static file storage.",
            "CI/CD automation via CodeBuild and GitHub ensures seamless updates without downtime."
          ]
        },
        {
          "title": "Artist Portfolio Website",
          "client": "Hazel Buchan",
          "date": "2024",
          "description": "A South African artist’s website was updated to be maintainable, responsive, and functional, featuring a contact page and an enquiry page for selling paper flowers. The site is live, optimized for easy updates, and includes CI/CD capabilities for seamless maintenance.",
          "image": "https://images.unsplash.com/photo-1522202176988-66273c2fd55f?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60",
          "link": "/projects/artist-portfolio",
          "technologies": [
            "Route53",
            "Cloudfront",
            "S3",
            "CodeBuild",
            "GitHub"
          ],
          "images": [
            {
              "imageUrl": "https://images.unsplash.com/photo-1547595620-f1bd2024b1e7?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Homepage of the artist's portfolio showcasing featured artwork."
            },
            {
              "imageUrl": "https://images.unsplash.com/photo-1521747116042-5a810fda9664?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Enquiry page for purchasing handmade paper flowers."
            }
          ],
          "longDescription": [
            "The portfolio website was designed to showcase the artist’s work in an engaging and interactive way.",
            "It includes a contact form and an enquiry system for customers interested in purchasing handmade paper flowers.",
            "Fully optimized for responsiveness, ensuring a great user experience on mobile and desktop.",
            "CI/CD capabilities enable automatic deployments via AWS services, reducing maintenance efforts."
          ]
        },
        {
          "title": "Consulting Company Website",
          "client": "Ignite Solutions",
          "date": "2021",
          "description": "A consulting company’s website was designed and deployed, featuring sections for services, contact information, and a theme aligned with their hexagon logo. The site is live, fully responsive, and includes CI/CD capabilities for seamless updates and maintenance.",
          "image": "https://images.unsplash.com/photo-1556742502-ec7c0e9f34b1?ixlib=rb-1.2.1&auto=format&fit=crop&w=500&q=60",
          "link": "/projects/consulting-company-website",
          "technologies": [
            "Route53",
            "Cloudfront",
            "S3",
            "CodeBuild",
            "GitHub"
          ],
          "images": [
            {
              "imageUrl": "https://images.unsplash.com/photo-1556157382-97eda2d62296?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Homepage displaying consulting services and company branding."
            },
            {
              "imageUrl": "https://images.unsplash.com/photo-1560264280-88b68371db39?ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
              "description": "Contact page with company details and enquiry form."
            }
          ],
          "longDescription": [
            "The consulting firm’s website was created to provide an online presence and showcase their services.",
            "It features an elegant and professional design, aligned with the company’s branding and hexagon-themed logo.",
            "The website is fully responsive and optimized for different devices, ensuring a smooth user experience.",
            "CI/CD capabilities enable easy updates through GitHub and AWS CodeBuild, allowing the site to be maintained with minimal effort."
          ]
        }
      ]
    }
  ]
}
